; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	satellite4 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	thermograph1 - mode
	infrared2 - mode
	thermograph4 - mode
	thermograph3 - mode
	image6 - mode
	thermograph5 - mode
	image0 - mode
	GroundStation2 - direction
	Star3 - direction
	Star1 - direction
	Star4 - direction
	GroundStation0 - direction
	Star6 - direction
	GroundStation5 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Planet10 - direction
	Planet11 - direction
)
(:init
	(supports instrument0 infrared2)
	(supports instrument0 thermograph1)
	(supports instrument0 thermograph5)
	(calibration_target instrument0 Star3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet7)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 GroundStation0)
	(calibration_target instrument1 Star3)
	(supports instrument2 image0)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 GroundStation5)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation0)
	(supports instrument3 image0)
	(calibration_target instrument3 Star1)
	(supports instrument4 infrared2)
	(calibration_target instrument4 GroundStation0)
	(calibration_target instrument4 Star4)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet9)
	(supports instrument5 thermograph3)
	(supports instrument5 thermograph5)
	(calibration_target instrument5 GroundStation0)
	(supports instrument6 image0)
	(supports instrument6 image6)
	(calibration_target instrument6 Star6)
	(calibration_target instrument6 GroundStation0)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon8)
	(supports instrument7 thermograph4)
	(supports instrument7 image6)
	(supports instrument7 thermograph3)
	(calibration_target instrument7 GroundStation0)
	(supports instrument8 thermograph1)
	(supports instrument8 infrared2)
	(calibration_target instrument8 GroundStation5)
	(supports instrument9 image0)
	(calibration_target instrument9 GroundStation5)
	(calibration_target instrument9 Star6)
	(on_board instrument7 satellite4)
	(on_board instrument8 satellite4)
	(on_board instrument9 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star6)
)
(:goal (and
	(pointing satellite2 Planet7)
	(pointing satellite3 Planet11)
	(have_image Planet7 thermograph1)
	(have_image Phenomenon8 thermograph5)
	(have_image Phenomenon8 thermograph4)
	(have_image Planet9 thermograph4)
	(have_image Planet9 thermograph1)
	(have_image Planet10 thermograph1)
	(have_image Planet10 thermograph3)
	(have_image Planet11 image6)
	(have_image Planet11 image0)
))

)

; plan
1. (turn_to satellite4 groundstation0 star6)
   deleted: (pointing satellite4 star6)
   added: (pointing satellite4 groundstation0)
   goals met: 0 of 11
2. (switch_on instrument7 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument7)
   goals met: 0 of 11
3. (calibrate satellite4 instrument7 groundstation0)
   added: (calibrated instrument7)
   goals met: 0 of 11
4. (turn_to satellite4 planet9 groundstation0)
   deleted: (pointing satellite4 groundstation0)
   added: (pointing satellite4 planet9)
   goals met: 0 of 11
5. (take_image satellite4 planet9 instrument7 thermograph4)
   added: (have_image planet9 thermograph4)
   goals met: 1 of 11
6. (turn_to satellite4 planet10 planet9)
   deleted: (pointing satellite4 planet9)
   added: (pointing satellite4 planet10)
   goals met: 1 of 11
7. (take_image satellite4 planet10 instrument7 thermograph3)
   added: (have_image planet10 thermograph3)
   goals met: 2 of 11
8. (turn_to satellite4 phenomenon8 planet10)
   deleted: (pointing satellite4 planet10)
   added: (pointing satellite4 phenomenon8)
   goals met: 2 of 11
9. (turn_to satellite3 groundstation0 phenomenon8)
   deleted: (pointing satellite3 phenomenon8)
   added: (pointing satellite3 groundstation0)
   goals met: 2 of 11
10. (turn_to satellite0 star3 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 star3)
   goals met: 2 of 11
11. (take_image satellite4 phenomenon8 instrument7 thermograph4)
   added: (have_image phenomenon8 thermograph4)
   goals met: 3 of 11
12. (switch_on instrument6 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument6)
   goals met: 3 of 11
13. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 3 of 11
14. (calibrate satellite3 instrument6 groundstation0)
   added: (calibrated instrument6)
   goals met: 3 of 11
15. (calibrate satellite0 instrument0 star3)
   added: (calibrated instrument0)
   goals met: 3 of 11
16. (turn_to satellite0 phenomenon8 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 phenomenon8)
   goals met: 3 of 11
17. (take_image satellite0 phenomenon8 instrument0 thermograph5)
   added: (have_image phenomenon8 thermograph5)
   goals met: 4 of 11
18. (turn_to satellite0 planet10 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 planet10)
   goals met: 4 of 11
19. (take_image satellite0 planet10 instrument0 thermograph1)
   added: (have_image planet10 thermograph1)
   goals met: 5 of 11
20. (turn_to satellite0 planet7 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 planet7)
   goals met: 5 of 11
21. (take_image satellite0 planet7 instrument0 thermograph1)
   added: (have_image planet7 thermograph1)
   goals met: 6 of 11
22. (turn_to satellite0 planet9 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 planet9)
   goals met: 6 of 11
23. (take_image satellite0 planet9 instrument0 thermograph1)
   added: (have_image planet9 thermograph1)
   goals met: 7 of 11
24. (turn_to satellite2 planet7 planet9)
   deleted: (pointing satellite2 planet9)
   added: (pointing satellite2 planet7)
   goals met: 8 of 11
25. (turn_to satellite3 planet11 groundstation0)
   deleted: (pointing satellite3 groundstation0)
   added: (pointing satellite3 planet11)
   goals met: 9 of 11
26. (take_image satellite3 planet11 instrument6 image0)
   added: (have_image planet11 image0)
   goals met: 10 of 11
27. (take_image satellite3 planet11 instrument6 image6)
   added: (have_image planet11 image6)
   goals met: 11 of 11
